Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions Methods
The AnalysisResultPositions type exposes the following members.
Methods
Name | Description
GetResultPositions
 Gets the analysis result positions.
Top
See Also
Reference
AnalysisResultPositions Class
Tekla.Structures.Analysis Namespace